In [ ]:
# create table
# INT: Whole Number
# DECIMAL(M,N): Total number of digits, Number of digits that can be stored after the decimal point
# VARCHAR(1): String of text of length of 1
# BLOB: Binary large object
# DATE: 'YYYY-MM-DD'
# TIMESTAMP: 'YYYY-MM-DD HH:MM:SS'

CREATE TABLE student (
    # columns, types
    student_id INT,
    name VARCHAR(20),
    major VARCHAR(20),
    PRIMARY KEY(student_id)
);

DESCRIBE student;

DROP TABLE student;

# Decimal numbers with up to 3 digits in total, and 2 digits after the decimal point
# For example: 1.23, 0.01, 123.45
ALTER TABLE student ADD gpa DECIMAL(3,2);

ALTER TABLE student DROP gpa;



INSERT INTO student VALUES(1, 'Jack', 'Biology');

INSERT INTO student VALUES(2, 'Kate', 'Sociology');

INSERT INTO student(student_id, name) VALUES(3, 'Claire');

INSERT INTO student
VALUES(4, 'Jack', 'Biology');

INSERT INTO student
VALUES(5, 'Mike', 'Computer Science');

SELECT * FROM student;






DROP TABLE student;

CREATE TABLE student (
    student_id INT,
    name VARCHAR(20) NOT NULL,
    major VARCHAR(20) UNIQUE,
    PRIMARY KEY(student_id)
);

INSERT INTO student VALUES(1, 'Jack', 'Biology');

INSERT INTO student VALUES(2, 'Kate', 'Sociology');

INSERT INTO student VALUES(3, NULL, 'Chemistry');

INSERT INTO student
VALUES(4, 'Jack', 'Biology');





DROP TABLE student;

CREATE TABLE student (
    student_id INT,
    name VARCHAR(20),
    major VARCHAR(20) DEFAULT('undecided'),
    PRIMARY KEY(student_id)
);

INSERT INTO student(student_id,name) VALUES(1, 'Jack');

SELECT * FROM student;





DROP TABLE student;

CREATE TABLE student (
    student_id INT AUTO_INCREMENT,
    name VARCHAR(20),
    major VARCHAR(20),
    PRIMARY KEY(student_id)
);

INSERT INTO student(name, major) VALUES('Jack', 'Biology');
INSERT INTO student(name, major) VALUES('Kate', 'Sociology');

SELECT * FROM student;




UPDATE student
SET major = 'Bio'
WHERE major = 'Biology';


UPDATE student
SET major = 'Comp Sci'
WHERE major = 'Computer Science';


UPDATE student
SET major = 'Comp Sci'
WHERE student_id = 4;


UPDATE student
SET name = 'Tom', major = 'undecided'
WHERE student_id = 1;


UPDATE student
SET major = 'undecided';


DELETE FROM student
WHERE name = 'Tom' AND major = 'undecided';


SELECT *
FROM student
WHERE major = 'Biology' OR name = 'Kate';

-- <, >, <=, >=, =, <>, AND, OR


SELECT *
FROM student
WHERE name IN ('Claire', 'Kate', 'Mike');